; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	satellite3 - satellite
	instrument4 - instrument
	image0 - mode
	thermograph1 - mode
	infrared3 - mode
	thermograph2 - mode
	Star3 - direction
	Star4 - direction
	GroundStation1 - direction
	Star5 - direction
	GroundStation0 - direction
	GroundStation6 - direction
	GroundStation2 - direction
	Star7 - direction
	Star8 - direction
	Planet9 - direction
	Planet10 - direction
	Phenomenon11 - direction
	Planet12 - direction
	Star13 - direction
	Planet14 - direction
	Star15 - direction
)
(:init
	(supports instrument0 thermograph1)
	(calibration_target instrument0 Star4)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star15)
	(supports instrument1 image0)
	(supports instrument1 infrared3)
	(supports instrument1 thermograph1)
	(calibration_target instrument1 Star5)
	(calibration_target instrument1 GroundStation1)
	(supports instrument2 image0)
	(supports instrument2 thermograph2)
	(supports instrument2 thermograph1)
	(calibration_target instrument2 GroundStation0)
	(calibration_target instrument2 GroundStation6)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation6)
	(supports instrument3 infrared3)
	(calibration_target instrument3 GroundStation2)
	(calibration_target instrument3 GroundStation6)
	(on_board instrument3 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star15)
	(supports instrument4 thermograph1)
	(supports instrument4 thermograph2)
	(supports instrument4 infrared3)
	(calibration_target instrument4 GroundStation2)
	(calibration_target instrument4 GroundStation6)
	(on_board instrument4 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Planet14)
)
(:goal (and
	(have_image Star7 thermograph1)
	(have_image Star8 thermograph1)
	(have_image Planet9 image0)
	(have_image Planet10 thermograph1)
	(have_image Phenomenon11 infrared3)
	(have_image Planet12 image0)
	(have_image Star13 thermograph2)
	(have_image Planet14 thermograph2)
	(have_image Star15 infrared3)
))

)

; plan
1. (turn_to satellite3 groundstation2 planet14)
   deleted: (pointing satellite3 planet14)
   added: (pointing satellite3 groundstation2)
   goals met: 0 of 9
2. (switch_on instrument4 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument4)
   goals met: 0 of 9
3. (calibrate satellite3 instrument4 groundstation2)
   added: (calibrated instrument4)
   goals met: 0 of 9
4. (turn_to satellite3 planet14 groundstation2)
   deleted: (pointing satellite3 groundstation2)
   added: (pointing satellite3 planet14)
   goals met: 0 of 9
5. (take_image satellite3 planet14 instrument4 thermograph2)
   added: (have_image planet14 thermograph2)
   goals met: 1 of 9
6. (turn_to satellite3 planet10 planet14)
   deleted: (pointing satellite3 planet14)
   added: (pointing satellite3 planet10)
   goals met: 1 of 9
7. (take_image satellite3 planet10 instrument4 thermograph1)
   added: (have_image planet10 thermograph1)
   goals met: 2 of 9
8. (turn_to satellite3 phenomenon11 planet10)
   deleted: (pointing satellite3 planet10)
   added: (pointing satellite3 phenomenon11)
   goals met: 2 of 9
9. (take_image satellite3 phenomenon11 instrument4 infrared3)
   added: (have_image phenomenon11 infrared3)
   goals met: 3 of 9
10. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 3 of 9
11. (calibrate satellite1 instrument2 groundstation6)
   added: (calibrated instrument2)
   goals met: 3 of 9
12. (turn_to satellite1 planet12 groundstation6)
   deleted: (pointing satellite1 groundstation6)
   added: (pointing satellite1 planet12)
   goals met: 3 of 9
13. (take_image satellite1 planet12 instrument2 image0)
   added: (have_image planet12 image0)
   goals met: 4 of 9
14. (turn_to satellite1 planet9 planet12)
   deleted: (pointing satellite1 planet12)
   added: (pointing satellite1 planet9)
   goals met: 4 of 9
15. (take_image satellite1 planet9 instrument2 image0)
   added: (have_image planet9 image0)
   goals met: 5 of 9
16. (turn_to satellite1 star13 planet9)
   deleted: (pointing satellite1 planet9)
   added: (pointing satellite1 star13)
   goals met: 5 of 9
17. (take_image satellite1 star13 instrument2 thermograph2)
   added: (have_image star13 thermograph2)
   goals met: 6 of 9
18. (turn_to satellite1 star7 star13)
   deleted: (pointing satellite1 star13)
   added: (pointing satellite1 star7)
   goals met: 6 of 9
19. (take_image satellite1 star7 instrument2 thermograph1)
   added: (have_image star7 thermograph1)
   goals met: 7 of 9
20. (turn_to satellite1 star8 star7)
   deleted: (pointing satellite1 star7)
   added: (pointing satellite1 star8)
   goals met: 7 of 9
21. (take_image satellite1 star8 instrument2 thermograph1)
   added: (have_image star8 thermograph1)
   goals met: 8 of 9
22. (turn_to satellite3 star15 phenomenon11)
   deleted: (pointing satellite3 phenomenon11)
   added: (pointing satellite3 star15)
   goals met: 8 of 9
23. (take_image satellite3 star15 instrument4 infrared3)
   added: (have_image star15 infrared3)
   goals met: 9 of 9
